app/commands/authenticate_user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ussds@mail.com"], ["LIMIT", 1]]
---
    def user
      user = User.find_by_email(email)