app/controllers/article_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 13]]
---
    def article_by_user_id
        render json: Article.where(user_id: @current_user.id)

SELECT users.*,articles.* FROM "articles" INNER JOIN "users" ON "users"."id" = "articles"."user_id"
SELECT users.*,articles.* FROM "users" INNER JOIN "articles" ON "articles"."user_id" = "users"."id" WHERE (articles.id = 4)
---
    def show_article_by_id
        #  kuch chhut rha h
        # render json: User.all
        @articles_with_users =  Article.joins(:user)
        render json: @articles_with_users.select("users.*,articles.*")

SELECT users.*,articles.* FROM "users" INNER JOIN "articles" ON "articles"."user_id" = "users"."id"
---
    def show_all_articles
        @articles_with_users = User.joins(:articles).select("users.*,articles.*")

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Comic"], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "article_desc", "created_at", "updated_at", "user_id", "category_id", "imgurl", "nlikes", "ncomments") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create_article
        @category = Category.find_by(name: params[:category_name])
        # render json: @category
        render json: Article.create(title: params[:title],article_desc: params[:article_desc],user_id: @current_user.id,category_id: @category.id, nlikes: params[:nlikes],ncomments: params[:ncomments],imgurl: params[:imgurl])

SELECT "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT ?  [["title", "asdfghjkl"], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 13]]
---
    def delete_article
        @article_to_delete = Article.find_by(title: params[:title])
        # render json:@article_to_delete
        # if(@current_user.id == @article_to_delete.user_id)
        @article_to_delete.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def update_article
        @article_to_update = Article.find_by_id(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Comic"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]
---
    def show_articles_by_cat_name
        @category = Category.find_by(name: params[:category_name])
        render json: Article.where(category_id: @category.id)

SELECT "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT ?  [["title", "new article"], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "created_at", "updated_at", "article_id", "likes") VALUES (?, ?, ?, ?, ?)  [["user_id", 20], ["created_at", "2023-02-20 07:44:30.148817"], ["updated_at", "2023-02-20 07:44:30.148817"], ["article_id", 4], ["likes", "lakhan"]]
UPDATE "articles" SET "nlikes" = COALESCE("nlikes", 0) + ? WHERE "articles"."id" = ?  [["nlikes", 1], ["id", 4]]
---
    def increse_likes
        @article = Article.find_by(title: params[:title])
        # render json: @article
        @like = Like.create(user_id: @current_user.id,likes: @current_user.name, article_id: @article.id)
        # @article = Article.find_by(title: params[title])
        # @article.nlikes = @article.nlikes + 1
        # @article.nlikes += 1
        @article.increment!(:nlikes)

SELECT "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT ?  [["title", "ewfbibief"], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "created_at", "updated_at", "article_id", "name") VALUES (?, ?, ?, ?, ?, ?)  [["content", nil], ["user_id", 17], ["created_at", "2023-02-20 10:34:47.598783"], ["updated_at", "2023-02-20 10:34:47.598783"], ["article_id", 5], ["name", nil]]
UPDATE "articles" SET "ncomments" = COALESCE("ncomments", 0) + ? WHERE "articles"."id" = ?  [["ncomments", 1], ["id", 5]]
---
    def increse_comments
        @article = Article.find_by(title: params[:title])
        @comment = Comment.create(content: params[:content], user_id: @current_user.id,name: @current_user.name,article_id: @article.id)
        # @article = Article.find_by(title: params[title])
        # @article.comments = @article.comments + 1
        @article.increment!(:ncomments)

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 19]]
UPDATE "articles" SET "nlikes" = COALESCE("nlikes", 0) - ? WHERE "articles"."id" = ?  [["nlikes", 1], ["id", 4]]
---
    def decrease_likes
        @like = Like.find(user_id: @current_user.id)
        @article = Article.find_by(title: params[:title])

        @like.destroy
        # @article.nlikes = @article.nlikes + 1
        # @article.nlikes += 1
        @article.decrement!(:nlikes)

SELECT "likes".* FROM "likes" WHERE "likes"."article_id" = ?  [["article_id", 4]]
---
    def show_likes_of_article
        render json: Like.where(article_id: params[:article_id])

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 4]]
---
    def show_comments_of_article
        render json: Comment.where(article_id: params[:article_id])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 14]]
---
    def delete_user
        @current_user.destroy