app/controllers/category_controller.rb

SELECT "categories".* FROM "categories"
---
    def show_all_categories
         render json: Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Personal"], ["created_at", "2023-02-20 09:37:07.376822"], ["updated_at", "2023-02-20 09:37:07.376822"]]
---
    def add_category
        Category.create(name: params[:name])