app/controllers/signup_controller.rb

    def signup
        render json: User.create(name: params[:name], description: params[:description], email: params[:email], password: params[:password])
---
INSERT INTO "users" ("name", "description", "email", "password_digest", "created_at", "updated_at", "profile_pic") VALUES (?, ?, ?, ?, ?, ?, ?)