app/controllers/user_controller.rb

    def show_user_by_user_email

        @user = User.where(id: @current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 12]]